Documents/ЗагрузкаИсторииПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗагрузкаИсторииПлатежей</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсторияПлатежей</xr:Item>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересчитать</Name>
					<Comment>Если признак установлен, сумма в валюте регламентного учета будет пересчитана</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаВПроизвольнойВалюте</Name>
					<Comment>Если признак не установлен, задолженность будет загружена в валюте ДО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПлатежа</Name>
							<Comment>Сумма в валюте платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДвиженияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидДвиженияЗадолженности</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебноеРешение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашенаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбещаниеОплатить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКатегории</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗагрузкаИсторииПлатежей/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия) Экспорт                                          	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеПлатежейОбъекты.НомерСтроки,
	               |	ПоступлениеПлатежейОбъекты.Ссылка КАК Регистратор,
	               |	ПоступлениеПлатежейОбъекты.ДатаПлатежа,
	               |	ПоступлениеПлатежейОбъекты.Объект,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеПлатежейОбъекты.ВалютаПлатежа = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА &ВалютаРегл
	               |		ИНАЧЕ ПоступлениеПлатежейОбъекты.ВалютаПлатежа
	               |	КОНЕЦ КАК ВалютаПлатежа,
	               |	ПоступлениеПлатежейОбъекты.ОсновнойДолг,
	               |	ПоступлениеПлатежейОбъекты.Проценты,
	               |	ПоступлениеПлатежейОбъекты.Штрафы,
	               |	ПоступлениеПлатежейОбъекты.Пени,
	               |	ПоступлениеПлатежейОбъекты.Составляющая1,
	               |	ПоступлениеПлатежейОбъекты.Составляющая2,
	               |	ПоступлениеПлатежейОбъекты.Составляющая3,
	               |	ПоступлениеПлатежейОбъекты.Составляющая4,
	               |	ПоступлениеПлатежейОбъекты.Составляющая5,
	               |	ПоступлениеПлатежейОбъекты.Составляющая6,
	               |	ПоступлениеПлатежейОбъекты.Составляющая7,
	               |	ПоступлениеПлатежейОбъекты.Составляющая8
	               |ПОМЕСТИТЬ Объекты
	               |ИЗ
	               |	Документ.ПоступлениеПлатежей.Объекты КАК ПоступлениеПлатежейОбъекты
	               |ГДЕ
	               |	ПоступлениеПлатежейОбъекты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты.ДатаПлатежа,
	               |	Объекты.ВалютаПлатежа
	               |ПОМЕСТИТЬ Таб1
	               |ИЗ
	               |	Объекты КАК Объекты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объекты.ДатаПлатежа,
	               |	Объекты.ВалютаПлатежа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб1.ВалютаПлатежа,
	               |	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	               |	Таб1.ДатаПлатежа
	               |ПОМЕСТИТЬ СрезПоДате1
	               |ИЗ
	               |	Таб1 КАК Таб1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО Таб1.ВалютаПлатежа = КурсыВалют.Валюта
	               |			И Таб1.ДатаПлатежа >= КурсыВалют.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб1.ВалютаПлатежа,
	               |	Таб1.ДатаПлатежа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таб1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СрезПоДате1.ДатаПлатежа,
	               |	СрезПоДате1.ВалютаПлатежа,
	               |	КурсыВалют.Курс * КурсыВалют.Кратность КАК КратностьНаКурс1
	               |ПОМЕСТИТЬ ИтогиПоВалютам1
	               |ИЗ
	               |	СрезПоДате1 КАК СрезПоДате1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО СрезПоДате1.ВалютаПлатежа = КурсыВалют.Валюта
	               |			И СрезПоДате1.Период = КурсыВалют.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрезПоДате1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты.НомерСтроки,
	               |	Объекты.Регистратор,
	               |	Объекты.ДатаПлатежа,
	               |	Объекты.Объект,
	               |	Объекты.ВалютаПлатежа,
	               |	Объекты.ОсновнойДолг,
	               |	Объекты.Проценты,
	               |	Объекты.Штрафы,
	               |	Объекты.Пени,
	               |	Объекты.Составляющая1,
	               |	Объекты.Составляющая2,
	               |	Объекты.Составляющая3,
	               |	Объекты.Составляющая4,
	               |	Объекты.Составляющая5,
	               |	Объекты.Составляющая6,
	               |	Объекты.Составляющая7,
	               |	Объекты.Составляющая8,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |ПОМЕСТИТЬ Объекты2
	               |ИЗ
	               |	Объекты КАК Объекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	               |		ПО Объекты.Объект = ДолговыеОбязательства.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Объекты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты2.ДатаПлатежа,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |ПОМЕСТИТЬ Таб2
	               |ИЗ
	               |	Объекты2 КАК Объекты2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	               |		ПО Объекты2.Объект = ДолговыеОбязательства.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Объекты2.ДатаПлатежа,
	               |	ДолговыеОбязательства.ВалютаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб2.ВалютаДоговора,
	               |	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	               |	Таб2.ДатаПлатежа
	               |ПОМЕСТИТЬ СрезПоДате2
	               |ИЗ
	               |	Таб2 КАК Таб2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО Таб2.ВалютаДоговора = КурсыВалют.Валюта
	               |			И Таб2.ДатаПлатежа >= КурсыВалют.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб2.ВалютаДоговора,
	               |	Таб2.ДатаПлатежа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таб2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СрезПоДате2.ДатаПлатежа,
	               |	СрезПоДате2.ВалютаДоговора,
	               |	КурсыВалют.Курс * КурсыВалют.Кратность КАК КратностьНаКурс2
	               |ПОМЕСТИТЬ ИтогиПоВалютам2
	               |ИЗ
	               |	СрезПоДате2 КАК СрезПоДате2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО СрезПоДате2.ВалютаДоговора = КурсыВалют.Валюта
	               |			И СрезПоДате2.Период = КурсыВалют.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрезПоДате2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Объекты2.Регистратор,
	               |	Объекты2.НомерСтроки,
	               |	Объекты2.Регистратор КАК Регистратор1,
	               |	Объекты2.ДатаПлатежа,
	               |	Объекты2.Объект,
	               |	Объекты2.ВалютаПлатежа КАК ВалПЛ,
	               |	Объекты2.ОсновнойДолг,
	               |	Объекты2.Проценты,
	               |	Объекты2.Штрафы,
	               |	Объекты2.Пени,
	               |	Объекты2.Составляющая1,
	               |	Объекты2.Составляющая2,
	               |	Объекты2.Составляющая3,
	               |	Объекты2.Составляющая4,
	               |	Объекты2.Составляющая5,
	               |	Объекты2.Составляющая6,
	               |	Объекты2.Составляющая7,
	               |	Объекты2.Составляющая8,
	               |	Объекты2.ВалютаДоговора КАК ВалДО,
	               |	ИтогиПоВалютам1.КратностьНаКурс1 КАК КурсПЛ,
	               |	ИтогиПоВалютам2.КратностьНаКурс2 КАК КурсДО
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	Объекты2 КАК Объекты2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоВалютам1 КАК ИтогиПоВалютам1
	               |		ПО Объекты2.ДатаПлатежа = ИтогиПоВалютам1.ДатаПлатежа
	               |			И Объекты2.ВалютаПлатежа = ИтогиПоВалютам1.ВалютаПлатежа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоВалютам2 КАК ИтогиПоВалютам2
	               |		ПО Объекты2.ДатаПлатежа = ИтогиПоВалютам2.ДатаПлатежа
	               |			И Объекты2.ВалютаДоговора = ИтогиПоВалютам2.ВалютаДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИтогиПоВалютам1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИтогиПоВалютам2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.НомерСтроки,
	               |	Итог.Регистратор,
	               |	Итог.ВалДО,
	               |	Итог.ВалПЛ,
	               |	Итог.КурсДО,
	               |	Итог.КурсПЛ,
	               |	Итог.Объект,
	               |	Итог.ДатаПлатежа КАК Период,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК СуммаДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8
	               |		ИНАЧЕ (Итог.ОсновнойДолг + Итог.Проценты + Итог.Штрафы + Итог.Пени + Итог.Составляющая1 + Итог.Составляющая2 + Итог.Составляющая3 + Итог.Составляющая4 + Итог.Составляющая5 + Итог.Составляющая6 + Итог.Составляющая7 + Итог.Составляющая8) * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК СуммаРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.ОсновнойДолг
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.ОсновнойДолг * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ОсновнойДолгДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.ОсновнойДолг
	               |		ИНАЧЕ Итог.ОсновнойДолг * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ОсновнойДолгРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Проценты
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Проценты / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Проценты * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ПроцентыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Проценты
	               |		ИНАЧЕ Итог.Проценты * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ПроцентыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Штрафы
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Штрафы * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ШтрафыДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Штрафы
	               |		ИНАЧЕ Итог.Штрафы * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ШтрафыРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Пени
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Пени / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Пени * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ПениДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Пени
	               |		ИНАЧЕ Итог.Пени * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК ПениРегл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая1
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая1 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая1ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая1
	               |		ИНАЧЕ Итог.Составляющая1 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая1Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая2
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая2 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая2ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая2
	               |		ИНАЧЕ Итог.Составляющая2 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая2Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая3
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая3 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая3ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая3
	               |		ИНАЧЕ Итог.Составляющая3 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая3Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая4
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая4 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая4ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая4
	               |		ИНАЧЕ Итог.Составляющая4 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая4Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая5
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая5 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая5ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая5
	               |		ИНАЧЕ Итог.Составляющая5 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая5Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая6
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая6 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая6ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая6
	               |		ИНАЧЕ Итог.Составляющая6 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая6Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая7
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая7 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая7ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая7
	               |		ИНАЧЕ Итог.Составляющая7 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая7Регл,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = Итог.ВалДО
	               |			ТОГДА Итог.Составляющая8
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8 / ЕСТЬNULL(Итог.КурсДО, 1)
	               |		ИНАЧЕ Итог.Составляющая8 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая8ДО,
	               |	ВЫБОР
	               |		КОГДА Итог.ВалПЛ = &ВалютаРегл
	               |			ТОГДА Итог.Составляющая8
	               |		ИНАЧЕ Итог.Составляющая8 * ЕСТЬNULL(Итог.КурсПЛ, 1)
	               |	КОНЕЦ КАК Составляющая8Регл
	               |ПОМЕСТИТЬ ДОЗагрузка
	               |ИЗ
	               |	Итог КАК Итог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Итог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияЗадолженности.Списание) КАК ВидДвиженияЗадолженности,
	               |	ДОЗагрузка.Объект,
	               |	ДОЗагрузка.ВалДО КАК ВалютаДО,
	               |	ДОЗагрузка.СуммаДО,
	               |	ДОЗагрузка.СуммаРегл,
	               |	ДОЗагрузка.ОсновнойДолгДО,
	               |	ДОЗагрузка.ОсновнойДолгРегл,
	               |	ДОЗагрузка.ПроцентыДО,
	               |	ДОЗагрузка.ПроцентыРегл,
	               |	ДОЗагрузка.ШтрафыДО,
	               |	ДОЗагрузка.ШтрафыРегл,
	               |	ДОЗагрузка.ПениДО,
	               |	ДОЗагрузка.ПениРегл,
	               |	ДОЗагрузка.Составляющая1ДО,
	               |	ДОЗагрузка.Составляющая1Регл,
	               |	ДОЗагрузка.Составляющая2ДО,
	               |	ДОЗагрузка.Составляющая2Регл,
	               |	ДОЗагрузка.Составляющая3ДО,
	               |	ДОЗагрузка.Составляющая3Регл,
	               |	ДОЗагрузка.Составляющая4ДО,
	               |	ДОЗагрузка.Составляющая4Регл,
	               |	ДОЗагрузка.Составляющая5ДО,
	               |	ДОЗагрузка.Составляющая5Регл,
	               |	ДОЗагрузка.Составляющая6ДО,
	               |	ДОЗагрузка.Составляющая6Регл,
	               |	ДОЗагрузка.Составляющая7ДО,
	               |	ДОЗагрузка.Составляющая7Регл,
	               |	ДОЗагрузка.Составляющая8ДО,
	               |	ДОЗагрузка.Составляющая8Регл
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДОЗагрузка.Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПогашенаЗадолженность) КАК ВидСобытия,
	               |	ДОЗагрузка.Регистратор КАК ИсточникСобытия,
	               |	ДОЗагрузка.Объект,
	               |	&Автор,
	               |	ДОЗагрузка.СуммаРегл КАК СуммаДокумента
	               |ИЗ
	               |	ДОЗагрузка КАК ДОЗагрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДОЗагрузка";					   
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДвиженийОбъекты = Результат[Результат.ВГраница() - 2].Выгрузить();
	ТаблицаДвиженийСобытия = Результат[Результат.ВГраница() - 1].Выгрузить();

КонецПроцедуры
